trunk/app/controllers/activos_controller.rb

SELECT * FROM "activos" WHERE (es_equipo = 't' AND LOWER(descripcion) ilike '%%')
---
  def buscador_activos_asg
    @resultados = Activo.find(:all)