trunk/app/controllers/asignados_controller.rb

SELECT * FROM "asignados"
---
  def index
    @asignados = Asignado.all