trunk/app/controllers/asignados_controller.rb

  def show
    @asignado = Asignado.find(params[:id])
    @asignados = LineasAsignado.find(:all, :conditions=>["asignado_id = ?", params[:id]])
---
SELECT * FROM "asignados" WHERE ("asignados"."id" = 1)
SELECT * FROM "lineas_asignados" WHERE (asignado_id = '1')

  def create
    @asignado = Asignado.new(params[:asignado])
    @asignado.esta_activo = false
    @asignado.save
---
INSERT INTO "asignados" ("fecha", "updated_at", "existencia_id", "persona_id", "esta_activo", "created_at") VALUES('2010-09-15', '2010-09-15 01:25:42.837835', 2, 1, 't', '2010-09-15 01:25:42.837835') RETURNING "id"

  def destroy
    @asignado = Asignado.find(params[:id])
    @asignado.destroy
---
SELECT * FROM "asignados" WHERE ("asignados"."id" = 4)
DELETE FROM "asignados" WHERE "id" = 4