trunk/app/controllers/despachos_controller.rb

SELECT * FROM "despachos"
---
  def index
    @despachos = Despacho.all