trunk/app/controllers/existencias_controller.rb

  def index
    @existencias = Existencia.all
---
SELECT * FROM "existencias"

  def show
    @existencia = Existencia.find(params[:id])
---
SELECT * FROM "existencias" WHERE ("existencias"."id" = 0)

  def new
    @activos = Activo.find(:all)
    @factura = Factura.find(:first, :conditions => ["id = ?", params[:id]])
    @existencias = Existencia.find(:all, :conditions => ["factura_id = ?", params[:id]])
---
SELECT * FROM "activos" WHERE ("activos"."id" = 2)
SELECT * FROM "facturas" WHERE (id = '1') LIMIT 1
SELECT * FROM "existencias" WHERE (factura_id = '1')

  def create
    @existencia = Existencia.new(params[:existencia])
    @activo = Activo.find(:first, :conditions => ["id = ?", @existencia.activo_id])
    if (@activo.es_equipo)
      @existencia.serial = params[:atributo]
      @existencia.cantidad = 1
      @existencia.saldo = 1
    else
      @existencia.cantidad = params[:atributo]
      @existencia.saldo = @existencia.cantidad
    end
    @existencia.save
---
SELECT * FROM "activos" WHERE ("activos"."id" = 2)
SELECT * FROM "existencias" WHERE (factura_id = 23092)
INSERT INTO "existencias" ("updated_at", "serial", "activo_id", "factura_id", "cantidad", "saldo", "es_asignado", "esta_activo", "created_at") VALUES('2010-09-05 23:09:50.929096', '23DS01', 2, 4, 1, 1, NULL, NULL, '2010-09-05 23:09:50.929096') RETURNING "id"

  def destroy
    @existencia = Existencia.find(params[:id])
    @existencia.destroy
---
SELECT * FROM "existencias" WHERE ("existencias"."id" = 5)
DELETE FROM "existencias" WHERE "id" = 5

  def procesar
    #procesar la factura y activar todos los registros de existencia
    @factura = Factura.find(:first, :conditions => ["id = ?", params[:id]])
    @factura.estado = 'procesada'
    @factura.save
    Existencia.update_all("esta_activo = true", "factura_id = #{params[:id]}")
---
SELECT * FROM "facturas" WHERE (id = 69832195480380) LIMIT 1
UPDATE "facturas" SET "estado" = 'procesada', "updated_at" = '2010-09-06 01:00:48.920373' WHERE "id" = 4
UPDATE "existencias" SET esta_activo = true WHERE (factura_id = 69832195155500)