trunk/app/controllers/facturas_controller.rb

SELECT * FROM "facturas"
---
  def index
    @facturas = Factura.paginate :page => (/[1-9]+/ === params[:page] ? params[:page] : 1), :per_page => 10

SELECT * FROM "facturas" WHERE ("facturas"."id" = 5)
SELECT * FROM "existencias" WHERE (factura_id = 7) LIMIT 1
---
  def show
    @factura = Factura.find(params[:id])
    @existencias = Existencia.find(:all, :conditions => ["factura_id = ?", @factura.id])

SELECT * FROM "facturas" WHERE ("facturas"."id" = 3)
---
  def edit
    @factura = Factura.find(params[:id])

INSERT INTO "facturas" ("fecha", "updated_at", "factura", "proveedor_id", "created_at", "estado") VALUES('2010-09-06 01:04:00.000000', '2010-09-06 01:04:51.244861', 2010, 1, '2010-09-06 01:04:51.244861', 'en proceso') RETURNING "id"
---
  def create
    @factura = Factura.new(params[:factura])
    @factura.save

SELECT * FROM "facturas" WHERE ("facturas"."id" = 1)
DELETE FROM "facturas" WHERE "id" = 1
---
  def destroy
    @factura = Factura.find(params[:id])
    @factura.destroy

SELECT * FROM "facturas" WHERE ("facturas"."id" = 5)
UPDATE "facturas" SET "estado" = 'anulado', "updated_at" = '2010-09-10 03:18:35.901253' WHERE "id" = 4
UPDATE "existencias" SET esta_activo = false WHERE (factura_id = 4)
---
  def anular
    @factura = Factura.find(params[:id])
    if @factura.update_attribute("estado", "anulado")
      Existencia.update_all("esta_activo = false", "factura_id = #{params[:id]}")