trunk/app/controllers/fichas_controller.rb

SELECT * FROM "fichas"
---
  def index
    @fichas = Ficha.all

SELECT * FROM "umedidas" WHERE ("umedidas"."id" = 2)
SELECT * FROM "activos" WHERE (id = '40') LIMIT 1
SELECT * FROM "fichas" WHERE (activo_id = 40)
---
  def new
    @umedidas = Umedida.find(:all)
    @activo = Activo.find(:first, :conditions => ["id = ?", params[:id]])
    @fichas =  Ficha.find(:all, :conditions => ["activo_id = ?", @activo.id])

INSERT INTO "fichas" ("fecha", "umedida_id", "componente", "updated_at", "activo_id", "medida", "created_at") VALUES('2010-08-21', NULL, 'Disco Duro', '2010-08-21 23:39:29.008982', 20, 250, '2010-08-21 23:39:29.008982') RETURNING "id"
SELECT * FROM "umedidas" WHERE ("umedidas"."id" = 2)
SELECT * FROM "activos" WHERE ("activos"."id" = 23)
SELECT * FROM "fichas" WHERE (activo_id = NULL)
---
  def create
    @ficha = Ficha.new(params[:ficha])
    @ficha.save
    @umedidas = Umedida.find(:all)
    @fichas =  Ficha.find(:all, :conditions => ["activo_id = ?", @ficha.activo_id])

SELECT * FROM "fichas" WHERE ("fichas"."id" = 27)
DELETE FROM "fichas" WHERE "id" = 27
SELECT * FROM "umedidas" WHERE ("umedidas"."id" = 2)
---
  def destroy
    @ficha = Ficha.find(params[:id])
    @ficha.destroy
    @umedidas = Umedida.find(:all)