trunk/app/controllers/motivos_controller.rb

SELECT * FROM "motivos"
---
  def index
    @motivos = Motivo.all

SELECT * FROM "motivos" WHERE ("motivos"."id" = 1)
---
  def show
    @motivo = Motivo.find(params[:id])

INSERT INTO "motivos" ("updated_at", "descripcion", "created_at") VALUES('2010-10-28 03:59:04.479834', 'Re-Asignado', '2010-10-28 03:59:04.479834') RETURNING "id"
---
  def create
    @motivo = Motivo.new(params[:motivo])

    respond_to do |format|
      if @motivo.save