trunk/app/controllers/personas_controller.rb

SELECT * FROM "personas" WHERE ("personas"."id" = 1)
---
  def show
    @persona = Persona.find(params[:id])

SELECT * FROM "personas" WHERE ("personas"."id" = 1)
---
  def edit
    @persona = Persona.find(params[:id])

INSERT INTO "personas" ("cedula", "apellido", "updated_at", "nombre", "carea_id", "cargo", "ubicacione_id", "created_at") VALUES('16074351', 'Benitez', '2010-08-20 05:02:30.323470', 'Miguel', 1, 'Coordinador de Área', 1, '2010-08-20 05:02:30.323470') RETURNING "id"
---
  def create
    @persona = Persona.new(params[:persona])

    respond_to do |format|
      if @persona.save

SELECT * FROM "personas" WHERE ("personas"."id" = 2)
UPDATE "personas" SET "carea_id" = 2, "updated_at" = '2010-10-22 00:43:38.788072' WHERE "id" = 2
---
  def update
    @persona = Persona.find(params[:id])

    respond_to do |format|
      if @persona.update_attributes(params[:persona])