trunk/app/controllers/ubicaciones_controller.rb

SELECT * FROM "ubicaciones"
---
  def index
    @ubicaciones = Ubicacione.all

SELECT * FROM "ubicaciones" WHERE ("ubicaciones"."id" = 1)
---
  def show
    @ubicacione = Ubicacione.find(params[:id])

SELECT * FROM "ubicaciones" WHERE ("ubicaciones"."id" = 3)
---
  def edit
    @ubicacione = Ubicacione.find(params[:id])

INSERT INTO "ubicaciones" ("updated_at", "descripcion", "created_at") VALUES('2010-08-20 03:44:50.038442', 'Molino-Moron', '2010-08-20 03:44:50.038442') RETURNING "id"
---
  def create
    @ubicacione = Ubicacione.new(params[:ubicacione])

    respond_to do |format|
      if @ubicacione.save

SELECT * FROM "ubicaciones" WHERE ("ubicaciones"."id" = 3)
UPDATE "ubicaciones" SET "descripcion" = 'Recubiertos - Maracay', "updated_at" = '2010-10-25 23:55:12.837068' WHERE "id" = 3
---
  def update
    @ubicacione = Ubicacione.find(params[:id])

    respond_to do |format|
      if @ubicacione.update_attributes(params[:ubicacione])