trunk/app/controllers/umedidas_controller.rb

  def index
    @umedidas = Umedida.all
---
SELECT * FROM "umedidas"

  def show
    @umedida = Umedida.find(params[:id])
---
SELECT * FROM "umedidas" WHERE ("umedidas"."id" = 1)

  def create
    @umedida = Umedida.new(params[:umedida])

    respond_to do |format|
      if @umedida.save
---
INSERT INTO "umedidas" ("updated_at", "descripcion", "created_at") VALUES('2010-08-21 18:20:41.048645', 'Mb', '2010-08-21 18:20:41.048645') RETURNING "id"