app/controllers/activos_controller.rb

  def index
    @activos = Activo.all
    @marcas = Marca.find(:all)
---
SELECT * FROM "activos"
SELECT * FROM "marcas" WHERE ("marcas"."id" = 1)

  def show
    @activo = Activo.find(params[:id])
    @fichas =  Ficha.find(:all, :conditions => ["activo_id = ?", @activo.id])
---
SELECT * FROM "activos" WHERE ("activos"."id" = 2)
SELECT * FROM "fichas" WHERE (activo_id = 42)

  def edit
    @activo = Activo.find(params[:id])
    @marcas = Marca.find(:all)
    @umedidas = Umedida.find(:all)
    @fichas =  Ficha.find(:all, :conditions => ["activo_id = ?", @activo.id])
---
SELECT * FROM "activos" WHERE ("activos"."id" = 4)
SELECT * FROM "umedidas" WHERE ("umedidas"."id" = 4)
SELECT * FROM "fichas" WHERE (activo_id = 42)

  def create
    @activo = Activo.new(params[:activo])
    @activo.save
---
INSERT INTO "activos" ("marca_id", "updated_at", "descripcion", "es_equipo", "modelo", "es_asignado", "created_at") VALUES(NULL, '2010-08-19 04:00:26.847393', 'Impresora', 't', 'M4345', NULL, '2010-08-19 04:00:26.847393') RETURNING "id"

  def update
    @activo = Activo.find(params[:id])
---
SELECT * FROM "activos" WHERE ("activos"."id" = 42)

  def destroy
    @activo = Activo.find(params[:id])
    @activo.destroy
---
SELECT * FROM "activos" WHERE ("activos"."id" = 5)
DELETE FROM "activos" WHERE "id" = 5

  def buscador_activos_asg
    @resultados = Activo.find(:all)
---
SELECT * FROM "activos" WHERE (es_equipo = 't' AND LOWER(descripcion) ilike '%%')

  def buscador
    @resultados = Activo.find(:all, :conditions => ["descripcion = ?", params[:activo][:descripcion]])
---
SELECT * FROM "activos" WHERE (LOWER(descripcion) ILIKE '%.downcase%')