app/controllers/careas_controller.rb

SELECT * FROM "careas"
---
  def index
    @careas = Carea.all

SELECT * FROM "careas" WHERE ("careas"."id" = 1)
---
  def show
    @carea = Carea.find(params[:id])

SELECT * FROM "careas" WHERE ("careas"."id" = 1)
---
  def edit
    @carea = Carea.find(params[:id])

INSERT INTO "careas" ("updated_at", "nombre", "cgeneral_id", "created_at") VALUES('2010-08-20 04:12:37.421951', 'Soporte Técnico', 1, '2010-08-20 04:12:37.421951') RETURNING "id"
---
  def create
    @carea = Carea.new(params[:carea])

    respond_to do |format|
      if @carea.save

SELECT * FROM "careas" WHERE ("careas"."id" = 2)
UPDATE "careas" SET "nombre" = 'Soporte Técnico & Atención a Usuario', "updated_at" = '2010-10-05 00:28:06.324852' WHERE "id" = 2
---
  def update
    @carea = Carea.find(params[:id])

    respond_to do |format|
      if @carea.update_attributes(params[:carea])