app/controllers/cgenerals_controller.rb

  def index
    @cgenerals = Cgeneral.all
---
SELECT * FROM "cgenerals"

  def show
    @cgeneral = Cgeneral.find(params[:id])
---
SELECT * FROM "cgenerals" WHERE ("cgenerals"."id" = 1)

  def edit
    @cgeneral = Cgeneral.find(params[:id])
---
SELECT * FROM "cgenerals" WHERE ("cgenerals"."id" = 1)

  def create
    @cgeneral = Cgeneral.new(params[:cgeneral])

    respond_to do |format|
      if @cgeneral.save
---
INSERT INTO "cgenerals" ("updated_at", "nombre", "created_at") VALUES('2010-08-20 04:02:42.000800', 'Coordinación General de Automatización & Telemática', '2010-08-20 04:02:42.000800') RETURNING "id"

  def update
    @cgeneral = Cgeneral.find(params[:id])

    respond_to do |format|
      if @cgeneral.update_attributes(params[:cgeneral])
---
SELECT * FROM "cgenerals" WHERE ("cgenerals"."id" = 1)
UPDATE "cgenerals" SET "nombre" = 'Automatización & Telemática', "updated_at" = '2010-08-20 04:17:13.596568' WHERE "id" = 1