app/controllers/desasignados_controller.rb

SELECT * FROM "desasignados"
---
  def index
    @desasignados = Desasignado.all