app/controllers/lineas_asignados_controller.rb

SELECT * FROM "lineas_asignados"
---
  def index
    @lineas_asignados = LineasAsignado.all

SELECT * FROM "asignados" WHERE (id = '1') LIMIT 1
SELECT * FROM "lineas_asignados" WHERE (asignado_id = '1')
---
  def new
    @linea_asignado = LineasAsignado.new
    @asignado = Asignado.find(:first, :conditions => ["id = ?", params[:id]])
    @asignados = LineasAsignado.find(:all, :conditions => ["asignado_id = ?", params[:id]])

SELECT * FROM "lineas_asignados" WHERE (asignado_id = NULL)
INSERT INTO "lineas_asignados" ("asignado_id", "updated_at", "existencia_id", "desasignado_id", "esta_activo", "created_at") VALUES(5, '2010-10-29 03:15:23.584331', 3, NULL, 't', '2010-10-29 03:15:23.584331') RETURNING "id"
SELECT * FROM "activos" WHERE ("activos"."id" = 1)
SELECT * FROM "existencias" WHERE ("existencias"."id" = 1)
UPDATE "existencias" SET "es_asignado" = 't', "updated_at" = '2010-10-27 03:31:27.290684' WHERE "id" = 1
---
  def create
    #Instancio el obejto con los datos colectados del formulario
    @lineas_asignado = LineasAsignado.new(params[:lineas_asignado])

    #Instancio un objeto nuevo para ser enviado al formulario y asigno el id del documento de asignación
    @linea_asignado = LineasAsignado.new
    @linea_asignado.asignado_id = @lineas_asignado.asignado_id


    #Verifico si realmente se ha elegido un activo para ser asignado
    if (@lineas_asignado.existencia_id.blank?)
      @mensaje =  "No ha elegido un activo para ser asignado"
      render :partial => "linea_asignado"
    else
      @lineas_asignado.esta_activo = true
      @lineas_asignado.save
      @existencia = Existencia.find(:first, :conditions => ["id = ?", @lineas_asignado.existencia_id])
      @existencia.update_attribute(:es_asignado, true)

SELECT * FROM "lineas_asignados" WHERE ("lineas_asignados"."id" = 10)
DELETE FROM "lineas_asignados" WHERE "id" = 10
SELECT * FROM "existencias" WHERE ("existencias"."id" = 1)
UPDATE "existencias" SET "es_asignado" = 'f', "updated_at" = '2010-10-29 03:24:20.916059' WHERE "id" = 7
---
  def destroy
    @lineas_asignado = LineasAsignado.find(params[:id])
    @lineas_asignado.destroy
    @existencia = Existencia.find(@lineas_asignado.existencia_id)
    @existencia.update_attribute(:es_asignado, false)