app/controllers/proveedors_controller.rb

  def index
    @proveedors = Proveedor.all
---
SELECT * FROM "proveedors"

  def show
    @proveedor = Proveedor.find(params[:id])
    @facturas = Factura.find(:all, :conditions => ["proveedor_id <= ?", params[:id]])
---
SELECT * FROM "proveedors" WHERE ("proveedors"."id" = 1)
SELECT * FROM "facturas" WHERE (proveedor_id <= '1')

  def edit
    @proveedor = Proveedor.find(params[:id])
---
SELECT * FROM "proveedors" WHERE ("proveedors"."id" = 1)

  def create
    @proveedor = Proveedor.new(params[:proveedor])

    respond_to do |format|
      if @proveedor.save
---
INSERT INTO "proveedors" ("updated_at", "nombre", "rif", "contacto", "direccion", "telefono", "created_at") VALUES('2010-08-19 01:06:25.568542', 'ECOPRINT', 'j-123456789-0', 'Pepe', 'Puerto la Cruz', '0212-3607157', '2010-08-19 01:06:25.568542') RETURNING "id"

  def update
    @proveedor = Proveedor.find(params[:id])
---
SELECT * FROM "proveedors" WHERE ("proveedors"."id" = 1)